import { z, ZodType } from 'zod';

const zodSchema: ZodType = z.object({
  username: z
    .string({ message: 'نام کاربری اجباری‌ است' })
    .regex(
      /^(([^<>()[\]\\.,;:\s@"]+(\.[^<>()[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))|[09|۰۹][0-9|۰۱۲۳۴۵۶۷۸۹]{10}$/,
      { message: 'نام کاربری را به درستی وارد کنید.' }
    ),
  password: z
    .string({ message: 'گذرواژه اجباری‌ است' })
    .regex(/^(?=.*[a-z])(?=.*[A-Z])(?=.*\d)[a-zA-Z\d@$_#!*%&() .]{8,}$/, {
      message: 'گذرواژه را به درستی وارد کنید.',
    }),
});

export { zodSchema };
